# Data Science with `R` Practice

This practice will be going over the fundamentals of data science with `R`. Much of the content will be similar to your lab, [Introduction to Data Science with R](../labs/intro_data_science_r.ipynb), and thus it will serve as a good guide post to answering some of the questions. We'll begin today with reading in the data...

## Read in the Data

In [1]:
df <- read.csv('/dsa/data/all_datasets/baby-names/NationalNames2.csv')

head(df)

  Id Name      Year Gender Count
1  4 Elizabeth 1880 F      1939
2  8 Alice     1880 F      1414
3 12 Clara     1880 F      1226
4 13 Ella      1880 F      1156
5 18 Nellie    1880 F       995
6 21 Maude     1880 F       858

Now that the data is read in, how would you remove the `Id` column from the dataframe in `R`. Remember, `R` is very flexible so there are several ways to remove columns. Do the following:

**Activity 1**: Remove the column `Id` from the dataframe and rename this data frame, `df`.

**Activity 2**: Find the dimensions (the number of rows and columns) of this updated data frame. *Hint: You will have to look up the function to do this as it was not mentioned in the lab*. 

**Activity 3**: Display the ***last*** 10 columns of the updated data frame.

In [2]:
#' Code for Activity 1 goes here -----------------------

df <- subset(df, select = -Id)

In [3]:
#' Code for Activity 2 goes here -----------------------

dim(df)

# Or

nrow(df)
ncol(df)

[1] 608892      4

[1] 608892

[1] 4

In [4]:
#' Code for Activity 3 goes here -----------------------
tail(df)

       Name  Year Gender Count
608887 Zijun 2014 M      5
608888 Zirui 2014 M      5
608889 Zo    2014 M      5
608890 Zyel  2014 M      5
608891 Zyran 2014 M      5
608892 Zyrin 2014 M      5

Below is one of the ways that you can subset a data frame. Run the code below to see what it returns.

In [5]:
head(df[df$Count > 2000,])

    Name    Year Gender Count
330 Charles 1880 M      5348
331 Thomas  1880 M      2534
985 James   1881 M      5442
986 Frank   1881 M      2834
987 Thomas  1881 M      2282
988 Robert  1881 M      2140

The bit of code only returns the first few rows of data but, in reality, there are lot more rows.

**Activity 4**: *Find out how many rows where the `Count` is greater than 2000.*

In [6]:
#' Code for Activity 4 goes here -----------------------

nrow(df[df$Count > 2000,])

[1] 10092

Now let's say that we were interested in only male names, particularly those names that are popular and not so popular.

**Activity 5**: subset the data set for rows where the gender is male and the count is above 2000 and below 100.

In [7]:
#' Code for Activity 5 goes here -----------------------

nrow(df[df$Gender == 'M' & c(df$Count > 2000 | df$Count < 100),])

[1] 221572

Imagine we were interested in names during a certain time period and we didn't need any of the data for the years were were not interested in. Let's say we were interested in names from the year 1950 through 1965. Below is one way to subset based on a specific year.

In [8]:
df1950 <- head(df[df$Year == 1950,])
df1965 <- head(df[df$Year == 1965,])

comb <- rbind(df1950,df1965)

head(comb);tail(comb)

       Name    Year Gender Count
153876 Mary    1950 F      65460
153877 Nancy   1950 F      29621
153878 Deborah 1950 F      29071
153879 Sandra  1950 F      28893
153880 Karen   1950 F      24139
153881 Pamela  1950 F      16200

       Name     Year Gender Count
211248 Patricia 1965 F      23554
211249 Linda    1965 F      19339
211250 Michelle 1965 F      16215
211251 Lori     1965 F      15698
211252 Teresa   1965 F      14578
211253 Barbara  1965 F      14026

**Questions**
1. What does the `rbind` function do?
2. Describe what the code above is doing.

In [9]:
?rbind

Answer the questions above here.
1.

rbind takes a sequence (vector, matrix, data-frame) of arguments and combines by columns or rows

2.

The above code stores the head (first 6 elements) of 2 df subsets based on Year = 1950 and Year = 1965.
The rbind funciton is then used to combine the two subsets (df1950 + df1965) into one combined data frame.
Finally, the head and tail of the new combined df are printed out.

Well, the above code would be extremely inefficient when trying to find all of the names between the years 1950 and 1965. How might you subset the data frame based off names between the year 1950 through 1965 without subsetting each year seperately. 

**Activity 6**: *Subset the data frame based off names between the year 1950 through 1965 without subsetting each year seperately.*

In [10]:
#' Code for Activity 6 goes here -----------------------

df1950.1965 <- subset(df[c(df$Year == 1950 | df$Year == 1965),])

head(df1950.1965)
tail(df1950.1965)

       Name    Year Gender Count
153876 Mary    1950 F      65460
153877 Nancy   1950 F      29621
153878 Deborah 1950 F      29071
153879 Sandra  1950 F      28893
153880 Karen   1950 F      24139
153881 Pamela  1950 F      16200

       Name   Year Gender Count
215204 Tylon  1965 M      5
215205 Tyre   1965 M      5
215206 Vahe   1965 M      5
215207 Vyron  1965 M      5
215208 Wadell 1965 M      5
215209 Wane   1965 M      5

## A Bit of Sorting

The code below sorts the data frame based of `Count`, but we can also sort the data alphabetically off of a column of strings.

In [11]:
head(df[order(df$Count),])

    Name      Year Gender Count
295 Adrienne  1880 F      5
296 Albertine 1880 F      5
297 Alys      1880 F      5
298 Celie     1880 F      5
299 Cordella  1880 F      5
300 Corrine   1880 F      5

**Activity 7**: Sort the data frame based on `Name` where the names starting with "Z" are on the top of the frame.

In [12]:
?order

In [20]:
#' Code for Activity 7 goes here -----------------------

head(df[order(df$Name, decreasing=TRUE),])

       Name      Year Gender Count
563987 Zzyzx     2010 M       5
552813 Zyvion    2009 M       5
506575 Zytavious 2005 M       5
573751 Zytaveon  2011 M       8
462463 Zyshonne  2001 M      12
506574 Zyshon    2005 M       5

## Manipulating data with dplyr

`dplyr` makes manipulating data a bit simpler. Take a look at the code below.

In [21]:
library(dplyr)
df %>%
    filter(Name == "Linda") %>%
    arrange(-Count) %>%
    head()

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

  Name  Year Gender Count
1 Linda 1952 F      67096
2 Linda 1953 F      61244
3 Linda 1946 F      52708
4 Linda 1955 F      51275
5 Linda 1957 F      44496
6 Linda 1945 F      41465

**Questions**
1. Describe what the code above is doing.

Answer the question above here.
1.

First, we load in the dplyr package.
Next, using the piping (%>%) technique we pass our data frame into the filter function, filtering out any non-Lisa name.
Then, we arrange (order) the resulting data frame based on Count in descending order.
Finally, we print out the first 6 rows, the head of the resulting df.

There is a lot more that you can do with `dplyr` such as renaming column names, lets try some.

**Activity 8**: *Copy the code above, but rename each of the columns so that the headers begin with lowercase letters. Name this data frame 'df_lower`.*

**Activity 9**: *Now, on the `df_lower` frame, remove the `gender` column.*

In [22]:
#' Code for Activity 8 goes here -----------------------
df_lower <- rename(read.csv('/dsa/data/all_datasets/baby-names/NationalNames2.csv'), id = Id, name = Name, year = Year, 
                   gender = Gender, count = Count)

In [23]:
head(df_lower)

  id name      year gender count
1  4 Elizabeth 1880 F      1939
2  8 Alice     1880 F      1414
3 12 Clara     1880 F      1226
4 13 Ella      1880 F      1156
5 18 Nellie    1880 F       995
6 21 Maude     1880 F       858

In [24]:
#' Code for Activity 9 goes here -----------------------

df_lower <- subset(df_lower, select = -gender)

In [25]:
head(df_lower)

  id name      year count
1  4 Elizabeth 1880 1939
2  8 Alice     1880 1414
3 12 Clara     1880 1226
4 13 Ella      1880 1156
5 18 Nellie    1880  995
6 21 Maude     1880  858

**Activity 10**: *Using `dplyr`, select rows based on both the names "Linda" and "John".*

In [30]:
#' Code for Activity 10 goes here -----------------------

df_LL <- df_lower %>% 
    filter(name == c("Linda", "John"))

In [31]:
head(df_LL)

  id    name  year count
1  6319 Linda 1883   49
2  8455 John  1884   40
3 10700 Linda 1885   60
4 18977 John  1888 9248
5 31362 John  1893   61
6 32672 John  1893 8049

**Challenge Activity 1**: *Use `dplyr` to find the max Count per year per name (both Linda and John).*

In [34]:
#' Code for Challenge Activity 1 goes here -----------------------

df_LL %>%
    filter(name == "Linda") %>%
    arrange(-count) %>%
    head(1)

df_LL %>%
    filter(name == "John") %>%
    arrange(-count) %>%
    head(1)

  id     name  year count
1 482689 Linda 1952 67096

  id     name year count
1 437160 John 1947 88318

# Save your notebook, then `File > Close and Halt`